website/website/tests/load/artillery-config.yml
# Artillery Load Test Configuration for Kamiyo API
#
# To run: artillery run tests/load/artillery-config.yml
#
# This tests the main API endpoints under realistic load conditions

config:
  target: "http://localhost:3001"
  phases:
    # Warm-up phase: 5 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"

    # Ramp-up phase: 5 to 50 users/sec over 60 seconds
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"

    # Sustained load: 50 users/sec for 120 seconds
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"

    # Spike test: 100 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 100
      name: "Spike test"

  # Performance thresholds
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    p95: 500 # 95th percentile response time < 500ms
    p99: 1000 # 99th percentile response time < 1000ms

scenarios:
  - name: "API Endpoints Test"
    weight: 100
    flow:
      # Test exploits endpoint
      - get:
          url: "/api/exploits?page=1&limit=20"
          capture:
            - json: "$.data[0].id"
              as: "exploitId"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data

      # Test chains endpoint
      - get:
          url: "/api/chains"
          expect:
            - statusCode: 200
            - contentType: json

      # Test stats endpoint
      - get:
          url: "/api/stats?days=7"
          expect:
            - statusCode: 200
            - contentType: json

      # Test health endpoint
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: json

      # Add think time between requests (simulate real user behavior)
      - think: 1